Tekla Open API Reference for Tekla Structures 2025
ConicalSurface.Apex Property
 Gets the apex of the cone. If it does not exist, it returns null
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point Apex { get; }
Public ReadOnly Property Apex As Point
	Get
Property Value
Type: Point
See Also
Reference
ConicalSurface Class
Tekla.Structures.Model Namespace